{
    "full_text": "The Robert S. Abbott House is a historic house at 4742 South Martin Luther King Jr. Drive in the Grand Boulevard community area of Chicago, Illinois. Built about 1900, it was home from 1926 until his death of Robert S. Abbott (1870-1940), founder and publisher of the Chicago Defender, the largest-circulation African-American newspaper in the nation. Abbott became one of the few self-made black millionaires in the early 20th century. His home was designated a National Historic Landmark status in 1976.\n\n\n== Description and history ==\nThe Robert S. Abbott House stands on Chicago's South Side, north of Washington Park on the west side of Martin Luther King Jr. Boulevard, on the same block that features the Harold Washington Cultural Center on the east side. It stands at the southern end of a group of row houses, and is the left side of an asymmetrical duplex. Its construction date is not known, but is estimated to be about 1900 based on its architectural style, which is a combination of Late Victorian and neo-Classical elements. The combined units share a hip roof, with that on the left featuring a large projecting gabled section two bays in width. To its right is a single bay, set next to the entrance to the adjacent unit, while the left unit's entrance is sheltered under a separate side porch on the left side. The porch has a limestone balustrade, with piers rising to Ionic columns supporting its roof. The interior, which has been further broken up into separate living units, retains some of its original grandeur.\nRobert Abbott, an African-American native of Georgia, was trained as a printer at the Hampton Institute, and migrated to Chicago, where he received a law degree at Kent College of Law. Unable to get work as a lawyer, he took a job in the city's printing department, where he conceived of the idea of printing and distributing handbill-sized newspapers to the city's African-American community. Founded in 1905, the Chicago Defender was an immediate success, and eventually grew to become the nation's largest circulation African-American newspaper. The newspaper, which circulated widely outside Chicago, has been described as a major influence in the Great Migration of African Americans out of the South, describing in a positive way conditions in the North, and unflinchingly describing lynchings and other acts of violence against African Americans in the South.\n\n\n== See also ==\nList of National Historic Landmarks in Illinois\nNational Register of Historic Places listings in South Side Chicago\n\n\n== References ==\n\n\n== External links ==\nHistoric American Buildings Survey (HABS) No. IL-1092, \"Robert S. Abbott House, 4742 Martin Luther King Drive, Chicago, Cook County, IL\", 1 photo, 1 photo caption page",
    "name": "Robert S. Abbott House",
    "picture_urls": [
        [
            "https://upload.wikimedia.org/wikipedia/commons/2/2a/Robert_S._Abbott_House%2C_4742_Martin_Luther_King_Drive%2C_Chicago_Cook_County%2C_Illinois.jpg",
            0
        ],
        [
            "https://sdesignublog.files.wordpress.com/2013/08/l-robabbott.jpg",
            1
        ]
    ],
    "state": "Illinois",
    "summary": "The Robert S. Abbott House is a historic house at 4742 South Martin Luther King Jr. Drive in the Grand Boulevard community area of Chicago, Illinois. Built about 1900, it was home from 1926 until his death of Robert S. Abbott (1870-1940), founder and publisher of the Chicago Defender, the largest-circulation African-American newspaper in the nation. Abbott became one of the few self-made black millionaires in the early 20th century. His home was designated a National Historic Landmark status in 1976.",
    "url": "https://en.wikipedia.org/wiki/Robert_S._Abbott_House"
}